# Study Summary

1. 一維陣列，可用 pd.Series 轉換成二維陣列
2. pd.Series + index
3. 用DataFrame把一維陣列，轉換成一個欄位的表格

## Summary

### Series

1. 一維陣列，可用pd.Series轉換成二維陣列

In [1]:
import pandas as pd

a = pd.Series([1, 2, 3])
a

0    1
1    2
2    3
dtype: int64

2. pd.Series + index

In [8]:
s = pd.Series([1, 2, 3], index = ['niya','lucy','olivia'])
s

niya      1
lucy      2
olivia    3
dtype: int64

### DataFrame

Pandas DataFrame can be created from the lists, dictionary, and from a list of dictionary etc

3. 用DataFrame把一維陣列，轉換成一個欄位的表格

In [11]:
df = pd.DataFrame([1, 2, 3])
df

   0
0  1
1  2
2  3

In [24]:
#加上 index、 column
df = pd.DataFrame([1, 2, 3], index = ['a', 'b', 'c'], columns = ['A'])
df

   A
a  1
b  2
c  3

4. 用DataFrame + index + columns，將一維陣列轉換成一個欄位的表格

In [15]:
df = pd.DataFrame([555, 'niya', 'F'], index = ['no','name','gender'], columns = ['member'])
df

       member
no        555
name     niya
gender      F

5. 用DataFrame 將二維陣列轉成多個表格

In [16]:
df = pd.DataFrame([[1,2,3], [4,5,6]])
df

   0  1  2
0  1  2  3
1  4  5  6

6. 用DataFrame + index + columns，將二維陣列轉換成多個欄位的表格

In [25]:
df = pd.DataFrame([[1,2,3], [4,5,6]], index = ['A', 'B'] , columns = ['a', 'b', 'c'])
df

   a  b  c
A  1  2  3
B  4  5  6

In [27]:
#指定僅印出b的資料
print(df['b'])

A    2
B    5
Name: b, dtype: int64

7. 用DataFrame，將dictionary轉換成多個欄位

In [35]:
df = pd.DataFrame({
    'name':['niya', 'bob', 'lily'],
    'age':[18, 20, 21],
})
df

   name  age
0  niya   18
1   bob   20
2  lily   21

8. 用DataFrame，將list轉換成多個欄位

In [36]:
df = pd.DataFrame([
    {'name': 'alice', 'age': '18'},
    {'name': 'bob', 'age': '20'},  
    {'name': 'lily', 'age': '21'},
])
df

    name age
0  alice  18
1    bob  20
2   lily  21

In [34]:
#指定只印出name
print(df[{'name'}])

    name
0  alice
1    bob

## [Homework]

1. 請建立類似提供結果的 DataFrame：
2. 請問如果現在有一個 DataFrame 如下，請問資料在 Python 中可能長怎樣？
3. 假設你想知道每個 weekday 的平均 visitor 數量，可以怎麼做？

## Homework

1. 請建立類似提供結果的 DataFrame：

In [17]:
import pandas as pd
import numpy as np

In [10]:
df = pd.DataFrame([[30, 21]], columns = ['Apples','Bananas'])
df

   Apples  Bananas
0      30       21

In [50]:
df = pd.DataFrame({
    ' ':['Sales', 'Sales'],
    'Apples': [35, 41],
    'Bananas':[21, 34],
}, index = [2017, 2018])
df

             Apples  Bananas
2017  Sales      35       21
2018  Sales      41       34

2. 請問如果現在有一個 DataFrame 如下，請問資料在 Python 中可能長怎樣？

In [104]:
#方法一
ww = pd.DataFrame({
    'city':['Austin', 'Dallas', 'Austin', 'Dallas'],
    'visitor':[139, 237, 326, 456],
    'weekday':['Sun','Sun','Mon','Mon']
})
ww

     city  visitor weekday
0  Austin      139     Sun
1  Dallas      237     Sun
2  Austin      326     Mon
3  Dallas      456     Mon

In [101]:
#方法二
d = [
    ['Austin', 139, 'Sun'],
    ['Dallas', 237, 'Sun'],
    ['Austin', 326, 'Mon'],
    ['Dallas', 456, 'Mon'],
    ]
result = pd.DataFrame(d, columns = ['city', 'visitors', 'weekday'])
result

     city  visitors weekday
0  Austin       139     Sun
1  Dallas       237     Sun
2  Austin       326     Mon
3  Dallas       456     Mon

3. 假設你想知道每個 weekday 的平均 visitor 數量，可以怎麼做？

In [102]:
for day in set(ww['weekday']):  #set不會包含重複的資料
    print(day, ww[ww['weekday'] == day]['visitor'].mean())

Mon 391.0
Sun 188.0

3. 假設你想知道每個 city 的總 visitor 數量，可以怎麼做？

In [115]:
for touris_city in set(ww['city']):
    print(touris_city, ww[ww['city'] == touris_city]['visitor'].sum())

Dallas 693
Austin 465